Repository: cedis-epublishing/sliderHome
Catalog: locale/*/locale.po
Languages: de_de, es_es

# plugins.generic.sliderHome.description
source: Displays a slider on the start page.
de_de: Zeigt auf der Startseite einen Slider an.
es_es: Muestra un slider en la página de inicio.

# plugins.generic.sliderHome.gridTitle
source: Slider Content
de_de: Sliderinhalte
es_es: Contenido del slider

# plugins.generic.sliderHome.addSliderContent
source: Add Slider Content
de_de: Sliderinhalt hinzufügen
es_es: Agregar contenido del slider

# plugins.generic.sliderHome.tooltip.editSliderContent
source: Edit Slider Content
de_de: Sliderinhalt bearbeiten
es_es: Editar contenido del slider

# plugins.generic.sliderHome.grid.title
source: Slider fields
es_es: Campos del slider

# plugins.generic.sliderHome.noneCreated
source: No fields have been created yet.
es_es: No se han creado campos del slider aún.

# plugins.generic.sliderHome.name
source: Name of this slider image
de_de: Name des Sliderbildes
es_es: Nombre de este slider

# plugins.generic.sliderHome.sliderName
source: Slider image name
de_de: Sliderbild Name
es_es: Nombre de esta imagen

# plugins.generic.sliderHome.copyright
source: Copyright notice
de_de: Copyright Hinweis
es_es: Aviso de derechos de autor

# plugins.generic.sliderHome.sliderImage
source: Slider image
de_de: Sliderbild
es_es: Imagen del slider

# plugins.generic.sliderHome.content
source: Note: The HTML provided here will be wrapped in a &lt;div id="slider-text" class="slider-text"&gt;&lt;/div&gt; providing a transparent background. You can modify the style from your journal stylesheet. You should not include images here.
de_de: Hinweis: Das hier eingegebene HTML wird in ein &lt;div id="slider-text" class="slider-text"&gt;&lt;/div&gt; eingefügt welches einen transparenten Hintergrund erzeugt. Sie können diesen im Stylesheet der Zeitschrift modifizieren. Hier sollten keine Bilder eingefügt werden.
es_es: No deberían colocarse imágenes aquí.

# plugins.generic.sliderHome.sliderImageLink
source: If you want to put a link on the slider image you can provide an URL here.
de_de: Wenn Sie das Sliderbild verlinken möchten können Sie hier eine URL angeben.
es_es: Si desea colocar un enlace en la imagen del control deslizante, puede proporcionar una URL aquí.

# plugins.generic.sliderHome.imageDetailsHint
source: If you want to put a link on the slider image or want to add an alternative text please first upload and save the slider image and then edit the saved slider entry again.
de_de: Wenn Sie das Sliderbild verlinken wollen oder einen Alternativtext eingeben wollen laden Sie bitte erst ein Sliderbild hoch und editieren Sie den gespeicherten Slidereintrag.
es_es: Si desea colocar un enlace en la imagen del control deslizante o desea agregar un texto alternativo, primero cargue y guarde la imagen del control deslizante y luego edite la entrada guardada del control deslizante nuevamente.

# plugins.generic.sliderHome.sliderTextContentLabel
source: Slider overlay HTML content
de_de: HTML-Inhalt für Überlagerung
es_es: Contenido HTML superpuesto del slider

# plugins.generic.sliderHome.noneExist
source: No content yet.
de_de: Kein Inhalt vorhanden.
es_es: No hay contenido aún.

# plugins.generic.sliderHome.showSliderContent
source: Show this slider content on home page.
de_de: Diesen Sliderinhalt auf der Startseite anzeigen.
es_es: Mostrar este slider en la página de inicio.

# plugins.generic.slider.settings.form.maxHeight.description
source: Maximum slider height as percentage of screen height.
de_de: Maximale Höhe des Sliders in Prozent des Bildschirms.
es_es: Máxima altura del slider como porcentaje de la altura de pantalla.

# plugins.generic.slider.settings.form.maxHeight
source: Slider height
de_de: Höhe des Sliders
es_es: Altura del slider

# plugins.generic.slider.settings.form.maxHeight.error
source: Error: slider height should be in the range of 0 to 100!
de_de: Fehler: Die Höhe sollte im Bereich 0 to 100 liegen!
es_es: Error: la altura del slider debe estar entre 1 y 100!

# plugins.generic.slider.settings.form.speed.description
source: Duration of transition between slides (in ms).
de_de: Dauer des Übergangs zwischen Slides (in ms).
es_es: Duración de la transición entre imágenes (en ms).

# plugins.generic.slider.settings.form.speed
source: Slider speed
de_de: Geschwindigkeit des Sliders
es_es: Velocidad del slider

# plugins.generic.slider.settings.form.speed.error
source: Error: slider speed should be a positive number!
de_de: Fehler: Die Geschwindigkeit sollte eine positive Zahl sein!
es_es: Error: la velocidad del slider debe ser un número positivo!

# plugins.generic.slider.settings.form.delay.description
source: Delay between transitions (in ms).
de_de: Verzögerung zwischen den Übergängen (in ms).
es_es: Demora entre transiciones (en ms).

# plugins.generic.slider.settings.form.delay
source: Slider delay
de_de: Verzögerung des Sliders
es_es: Demora del slider

# plugins.generic.slider.settings.form.delay.error
source: Error: slider delay should be a positive number!
de_de: Fehler: Die Verzögerung sollte eine positive Zahl sein!
es_es: Error: la demora del slider debe ser un número positivo!

# plugins.generic.slider.settings.form.stopOnLastSlide
source: Stop slideshow after last slide.
de_de: Slideshow nach einem Durchlauf anhalten.
es_es: Detener la presentación después de la última imagen.

# plugins.generic.slider.settings.form.stopOnLastSlide.boxLabel
source: Slider repetition
de_de: Slider Wiederholung
es_es: Repetición del slider

# plugins.generic.slider.settings.form.success
source: The slider settings have been updated. <a href="{$url}" target="_blank">View Now</a>
de_de: Die Slider-Einstellungen wurden aktualisiert. <a href="{$url}" target="_blank">Hier ansehen</a>
es_es: La configuración del slider ha sido actualizada. <a href="{$url}" target="_blank">Ver ahora</a>

# plugins.generic.slider.settings.form.groupLabel
source: Slider Settings
de_de: Slider Einstellungen
es_es: Configuración del slider

# plugins.generic.slider.settings.form.groupDescription
source: Please note:<br>The slider height is determined by the height of largest image shown. Only if this height exceeds the vertical resolution of the screen the slider height can be limited by setting the maximum slider height as percentage of the screen vertical resolution. Otherwise this setting will have no effect. Both, the height and the width of the images will be scaled.<br>To use the full slider width prepare the images with heights smaller than the vertical screen resolution.
de_de: Bitte beachten:<br>Die Sliderhöhe wird durch die Höhe des größten angezeigten Bildes bestimmt. Nur wenn diese Höhe die vertikale Bildschirmauflösung übersteigt, kann die Sliderhöhe durch setzen der maximalen Sliderhöhe in Prozent der vertikalen Auflösung limitiert werden. Ansonsten hat diese Einstellung keinen Effekt. Dabei wird sowohl die Höhe als auch die Breite der Bilder skaliert.<br>Um die volle Sliderbreite zu nutzen sollte die Höhe der Bilder kleiner als die vertikale Bildschirmauflösung sein.
es_es: Atención:<br> La altura del slider está determinada por la altura de la mayor imagen mostrada. Sólo si esta altura excede la resolución vertical de la pantalla se puede limitar la altura del slider estableciendo la altura máxima del slider como porcentaje de la resolución vertical de la pantalla. De lo contrario, este ajuste no tendrá ningún efecto; se escalarán tanto la altura como la anchura de las imágenes.<br>Para utilizar todo el ancho del slider prepare las imágenes con alturas inferiores a la resolución vertical de la pantalla.

# plugins.generic.sliderHome.displayName
source: Slider Home Plugin
de_de: Slider Plugin
